# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Binaries
brew "awscli"
brew "bash" # Bash 4
brew "bat"
brew "coreutils" # Those that come with macOS are outdated
brew "fzf"
brew "git"
brew "git-lfs"
brew "git-extras"
brew "gnupg2"
brew "grep"
brew "jq"
brew "mas"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash"
brew "tree"
brew "tmux"
brew "vlc"
brew "watch"
brew "zsh"
brew "zsh-completions"

# Apps
cask "alfred"
cask "authy"
cask "bartender"
cask "cleanmymac"
cask "deckset"
cask "docker"
cask "droplr"
cask "github"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "kap"
cask "minikube"
cask "now"
cask "postico"
cask "righfont"
cask "sequel-pro"
cask "sketch"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"

# App store
mas 'Encrypto', id: 935235287
mas 'Pixelmator Pro', id: 1289583905
mas 'Thor', id: 1120999687
mas 'Permute' , id: 731738567
mas 'Unsplash Wallpaper', id: 1284863847
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Amphetamine', id: 937984704
mas 'Contrast', id: 1254981365
mas 'Patterns', id: 429449079
mas 'Medis', id: 1063631769
mas 'Bear', id: 1091189122
mas 'Gifski', id: 1351639930
mas 'Gifox', id: 1082624744
mas 'Asset Catalog Create', id: 866571115
mas 'Svgsus', id: 1106867065
