# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Binaries
brew "awscli"
brew "bash" # Bash 4
brew "bat"
brew "composer"
brew "coreutils" # Those that come with macOS are outdated
brew "fnm"
brew "fzf"
brew "git"
brew "git-lfs"
brew "git-extras"
brew "gnupg2"
brew "grep"
brew "jq"
brew "mas"
brew "mtr"
brew "neovim"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash"
brew "tree"
brew "tmux"
brew "watch"
brew "zsh"
brew "zsh-completions"

# Apps
cask "android-studio"
cask "authy"
cask "bartender"
cask "betterdisplay"
cask "brave-browser"
cask "cleanmymac"
cask "cleanshot"
cask "coderunner"
cask "deckset"
cask "discord"
cask "docker"
cask "fliqlo"
cask "github"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "keybase"
cask "pdf-expert"
cask "pixelsnap"
cask "postico"
cask "postman"
cask "ngrok"
cask "notion"
cask "nordvpn"
cask "numi"
cask "messenger"
cask "minisim"
cask "raycast"
cask "rectangle"
cask "sip"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "telegram"
cask "todoist"
cask "tor-browser"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zoom"

# App store
mas 'Amphetamine', id: 937984704
mas 'Asset Catalog Create', id: 866571115
mas 'Bear', id: 1091189122
mas 'Contrast', id: 1254981365
mas 'Encrypto', id: 935235287
mas 'Gifski', id: 1351639930
mas 'Gifox', id: 1082624744
mas 'Keynote', id: 409183694
mas 'Medis', id: 1063631769
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704
mas 'Patterns', id: 429449079
mas 'Pixelmator Pro', id: 1289583905
mas 'Permute' , id: 731738567
mas 'RetroClip', id: 1332064978
mas 'Svgsus', id: 1106867065
mas 'Sequel Ace', id: 1518036000
mas 'Unsplash Wallpaper', id: 1284863847
